code-review/NRB_3471_3546/База_Стало/DataProcessors/УведомленияОСкоромОкончанииПриемаИнструкцийПоWTRC.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УведомленияОСкоромОкончанииПриемаИнструкцийПоWTRC</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаУведомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Депоненты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДепонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/УведомленияКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияКОтправке</Name>
			<Comment>EPAM объект</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПараметрыУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИменаВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПриОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИДУведомления</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/УведомленияОСкоромОкончанииПриемаИнструкцийПоWTRC/Ext/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС ОБРАБОТКИ

Функция УведомлениеОтправлено() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Уведомления.Депонент) КАК Количество
	|ИЗ
	|	РегистрСведений.УведомленияОСкоромОкончанииПриемаИнструкцийПоWTRC КАК Уведомления
	|ГДЕ
	|	Уведомления.Период = НАЧАЛОПЕРИОДА(&ДатаУведомления, ДЕНЬ)
	|");
	Запрос.УстановитьПараметр("ДатаУведомления", ДатаУведомления);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий()	И Выборка.Количество > 0;
	
КонецФункции

Процедура СформироватьСписокДепонентов() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(&ДатаУведомления, ДЕНЬ) КАК Период,
	|	ДепонентыWTRC.Депонент КАК Депонент,
	|	ДепонентыWTRC.Депонент.Код КАК КодДепонента
	|ИЗ
	|	БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты КАК ДепонентыWTRC
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ДепонентыWTRC.Ссылка.ДатаОкончанияРаскрытия, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаОтбораБП, ДЕНЬ)
	|	И НЕ ДепонентыWTRC.Ссылка.ПометкаУдаления
	|	И НЕ (
	|			ВЫРАЗИТЬ(ДепонентыWTRC.Ссылка.ЦеннаяБумага1.Эмитент.ЮридическиеФизическиеЛица
	|				КАК Справочник.ЮридическиеЛица).Страна.Код = &КодСША
	|			И НЕ ДепонентыWTRC.Ссылка.ЦеннаяБумага1.ТипЦБ = &ДепозитарнаяРасписка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДепонентыWTRC.Депонент.Код");
	ДатаОтбораБП = БизнесПроцессы.ОбработкаWTRCСообщения.ДатаСкорогоОкончанияПриемаИнструкцийНРД(ДатаУведомления);
	Запрос.УстановитьПараметр("ДатаОтбораБП",			ДатаОтбораБП);
	Запрос.УстановитьПараметр("ДатаУведомления",		ДатаУведомления);
	Запрос.УстановитьПараметр("КодСША",					"840");
	Запрос.УстановитьПараметр("ДепозитарнаяРасписка",	Перечисления.ТипыЦБ.ДепозитарнаяРасписка);
	Депоненты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ОтправитьУведомление() Экспорт
	
	Если Депоненты.Количество() > 0 Тогда
		НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
			ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОСкоромОкончанииПриемаИнструкцийПоWTRC).Настройка;
			
		НайденнаяСтрока = НастройкиОбмена.Параметры.Найти("Тема письма", "Наименование");
		Если НайденнаяСтрока = Неопределено Тогда
			ТемаПисьма = "<Без темы>";
		Иначе
			ТемаПисьма = НайденнаяСтрока.Значение;
		КонецЕсли;
		
		ДатаОтбораБП = БизнесПроцессы.ОбработкаWTRCСообщения.ДатаСкорогоОкончанияПриемаИнструкцийНРД(ДатаУведомления);
		ТекстУведомления = ТекстПисьма(ДатаУведомления, ДатаОтбораБП);

		ПараметрыУведомления = Новый Соответствие;
		ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
		ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
		ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
		ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстУведомления);
		ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
		ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
		
		РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);				
	Иначе
		ТекстУведомления = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьОтправленноеУведомлениеВРегистре() Экспорт
	
	Если Депоненты.Количество() = 0 Тогда
		Данные = Новый ТаблицаЗначений;
		Данные.Колонки.Добавить("Период");
		Данные.Колонки.Добавить("Депонент");
		
		НоваяСтрока = Данные.Добавить();
		НоваяСтрока.Период		= ДатаУведомления;
		НоваяСтрока.Депонент	= Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		Данные = Депоненты.Выгрузить(, "Период,Депонент");
	КонецЕсли;
	
	Набор = РегистрыСведений.УведомленияОСкоромОкончанииПриемаИнструкцийПоWTRC.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(ДатаУведомления);
	Набор.Загрузить(Данные);
	Набор.Записать();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ТекстПисьма(ДатаУведомления, ДатаОтбораБП)
	
	СтрокиТаблицы = "";
	Для Каждого Строка Из Депоненты Цикл
		ДанныеДепонента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<tr>
		|<td>%1</td>
		|</tr>
		|", СокрЛП(Строка.КодДепонента));
		СтрокиТаблицы = СтрокиТаблицы + ДанныеДепонента;
	КонецЦикла;
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<p>%1 заканчивается прием инструкций НРД по WTRC.</p>
		|<p>Депоненты, которые могут принять участие в КД WTRC по состоянию на %2:</p>
		|<table border=""1"" cellpadding=""5px"" cellspacing=""0"">
		|<tr>
		|<th>Код клиента</th>
		|</tr>
		|%3</table>
		|",
		Формат(ДатаОтбораБП, "ДЛФ=D"), Формат(ДатаУведомления, "ДЛФ=D"), СтрокиТаблицы);
	Возврат Текст;
	
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
